

int main(){
    int arr[3];
    int x;
    x = arr[1];
    return 23;
}

//=========================== C2RISC-Engine =========================================================//
// Lexical Analysis 👍 | Syntax Analysis 👍 | Semantic Analysis 👍 | 🔖 IRCode Gen
// 🌴 APTree 🌴 has been generated, can be used for debugging ❤️‍🩹 
// 
// ------------------------------------------------------------------------------------
// 
// ------------------------------------------------------------------------------------
// CodeLineNo : TAC                           
// ---------- : -------------------------------
// 
// 0          : main                          
// 1          : arr$1 (12 bytes)              
// 2          : x$1 (4 bytes)                 
// 3          : $0 = arr$1.offset             
// 4          : $1 (4 bytes)                  
// 5          : $1 = 1 * 4                    
// 6          : $2 (4 bytes)                  
// 7          : $2 = $0 + $1                  
// 8          : $3 (4 bytes)                  
// 9          : $3 = *$2                      
// 10         : x$1 = $3                      
// 11         : return 23                     
// 
